## ----include=FALSE,cache=FALSE-------------------------------------------
library(knitr)

opts_chunk$set(comment=NA, myCode=TRUE)
opts_template$set(myFig=list(fig.height=6,fig.width=6))
knit_hooks$set(
    myCode=function(before,options,envir){
        if(before){
            "\\footnotesize \\color{blue}"
        } else{
            "\\normalsize \\color{black}"
        }
    })

## ------------------------------------------------------------------------
Height=c(168,173,160,145,180)  # Height변수에 5명의 키 저장
result=mean(Height)                   # 평균    
result

## ------------------------------------------------------------------------
mypower=function(x){      # 새로운 함수 정의
    result=c(x^3)
    return(result)        # 결과 반환
}
mypower(3)

## ------------------------------------------------------------------------
1+2

## ------------------------------------------------------------------------
'+'(1,2)     # 1+2와 같다.
'*'(3,4)     # 3*4와 같다.
'/'(9,2)     # 9/2와 같다.

## ----eval=FALSE----------------------------------------------------------
## if(조건문) {
##     ...        # 조건문이 참일때 실행할 명령들
##     ...
## } else {
##     ...        # 조건문이 거짓일때 실행할 명령들
##     ...
## }
## 

## ----error=TRUE----------------------------------------------------------
mypower("moon")

## ------------------------------------------------------------------------
# 개선된 mypower함수     
mypower=function(x){         # 새로운 함수 정의
    if(is.numeric(x)) {      # 숫자인지 판단
       result=c(x^3)     # 숫자인 경우 세제곱 값 구함
       
    }
    else{                    
       result=NA             # 숫자가 아닌 경우 실행
    }
    result                   # 결과 반환 
}
mypower(3)
mypower("moon")

## ----eval=FALSE----------------------------------------------------------
## result=ifelse(조건문,참일 경우 값,거짓일 경우 값)

## ------------------------------------------------------------------------
# ifelse()함수로 개선된 mypower함수     
mypower2=function(x){         
    ifelse(is.numeric(x),c(x^3),NA)
}
mypower2(3)
mypower2("moon")

## ------------------------------------------------------------------------
x=3
mypower(x)
mypower2(x)
x=c(2,3,4)
mypower(x)
mypower2(x)

## ----eval=FALSE----------------------------------------------------------
## for ( 루프변수 in 리스트) {
##     ...       # 반복할 구문
##     ...
## }

## ------------------------------------------------------------------------
myfact=function(x) {
    result=1
    for(i in 1:x) {
        result=result*i
    }
    result
}
myfact(3)
myfact(5)

## ----fig.show='hold'-----------------------------------------------------
par(mfrow=c(2,2))
x=list(1:6, sin, function(x) {x^2+2*x}, dnorm)
for(i in x) plot(i,xlim=c(0,2*pi))
par(mfrow=c(1,1))

## ----eval=FALSE----------------------------------------------------------
## while (조건식) {  # 조건이 만족할 동안
##     ...           # 반복할 구문
##     ...           # 조건식이 처음부터 거짓이라면 한 번도 실행되지 않는다.
## }

## ------------------------------------------------------------------------
i=1
while(i<5) {
    i=i+1
}
i

## ------------------------------------------------------------------------
i=1
while(1) {           # 항상 실행
    if(i==5) break   # i가 5면 반복문에서 탈출 
    i=i+1
}
i

## ------------------------------------------------------------------------
oddSum=0                # 홀수의 합을 저장할 변수, 0으로 초기화
for(i in 1:100) {       # 1부터 100까지 반복 
    if(i%%2==0) next    # 짝수(2로 나눈 나머지가 0)이면 다음 반복으로 넘어간다.
    oddSum=oddSum+i
}
oddSum

## ------------------------------------------------------------------------
i=1
repeat {             # 항상 실행
    if(i==5) break   # i가 5면 반복문에서 탈출 
    i=i+1
}
i

